# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages
#+TITLE:       Laboratory Notebook for a Multi-Threaded Version of Quicksort
#+AUTHOR:      Arnaud Legrand
#+LANGUAGE:    en
#+TAGS: IMPORTANT(i) TEST(t) DEPRECATED(d) noexport(n)

** data/
This is where raw experimental data should go. Each directory entry
comprises a set of experiments and the directory name is based on the
machine name and on the date. For example:
#+begin_src sh :results output :exports both 
echo mkdir data/`hostname`_`date +%F`
#+end_src

#+RESULTS:
: mkdir data/sama_2014-10-13

** Compilation
A simple makefile with various compilation options is provided in the
src/ directory. Compilation is thus done by running the following command:
#+begin_src sh :results output :exports both 
make -C src/
#+end_src

#+RESULTS:
: make: Entering directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  -c -o parallelQuicksort.o parallelQuicksort.c
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  parallelQuicksort.o  -o parallelQuicksort 
: make: Leaving directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'

*** Initial code design
- I obtained an initial implementation from
  http://sc12.supercomputing.org/hpceducator/PythonForParallelism/codes/parallelQuicksort.c.
  According to the header, the original author is Joshua Stough from
  Washington and Lee University. I hope he will not mind that I reuse
  this piece of code for educational purposes.
- Here is a typical first execution on my laptop (an Intel(R) Core(TM)
  i7 running a Debian with Linux 3.14.15):
  #+begin_src sh :results output :exports both 
    ./src/quicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.231571 sec.
  : at loc 506315, 5.068226e-01 < 5.068269e-01 
  : Oops, lyst did not get sorted by parallelQuicksort.
  : Parallel quicksort took: 0.161259 sec.
  : Built-in qsort took: 0.241568 sec.

  Sweet, in my first attempt, it looks like this parallel version is
  indeed running faster than then sequential one. I have to say this
  warning message is stressing me a bit though.
- On smaller instances, the code would segfault. So I reindented the
  code and thanks to valgrind and gdb, I could find what was wrong. I
  also renamed the file so that compiling is more convenient. This
  fixed the previous warning message so now everything seems fine:
  #+begin_src sh :results output :exports both 
    ./src/parallelQuicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.239347 sec.
  : Parallel quicksort took: 0.176365 sec.
  : Built-in quicksort took: 0.244716 sec.

*** first execution on my laptop
#+begin_src sh :results output :exports both 
    ./src/parallelQuicksort
#+end_src

#+results:
: Sequential quicksort took: 0.237812 sec.
: Parallel quicksort took: 0.194654 sec.
: Built-in quicksort took: 0.243592 sec.

***** RAM
#+begin_src sh :results output :exports both 
    cat /proc/meminfo
#+end_src

#+results:
#+begin_example
MemTotal:        3951816 kB
MemFree:          174548 kB
Buffers:          889516 kB
Cached:          1563412 kB
SwapCached:            0 kB
Active:          1815368 kB
Inactive:        1760508 kB
Active(anon):     936180 kB
Inactive(anon):   500508 kB
Active(file):     879188 kB
Inactive(file):  1260000 kB
Unevictable:        1300 kB
Mlocked:              16 kB
SwapTotal:        262140 kB
SwapFree:         262140 kB
Dirty:               132 kB
Writeback:             0 kB
AnonPages:       1124248 kB
Mapped:           190252 kB
Shmem:            312464 kB
Slab:             110396 kB
SReclaimable:      79224 kB
SUnreclaim:        31172 kB
KernelStack:        3696 kB
PageTables:        30044 kB
NFS_Unstable:          0 kB
Bounce:                0 kB
WritebackTmp:          0 kB
CommitLimit:     2238048 kB
Committed_AS:    3555328 kB
VmallocTotal:   34359738367 kB
VmallocUsed:      444420 kB
VmallocChunk:   34359290460 kB
HardwareCorrupted:     0 kB
AnonHugePages:         0 kB
HugePages_Total:       0
HugePages_Free:        0
HugePages_Rsvd:        0
HugePages_Surp:        0
Hugepagesize:       2048 kB
DirectMap4k:       95404 kB
DirectMap2M:     4003840 kB
#+end_example

**** OS
Kernel Version :
#+begin_src sh :results output :exports both 
    uname -r
#+end_src

#+results:
: 3.11.0-15-generic

**** Compiler
#+begin_src sh :results output :exports both 
    gcc --version
#+end_src

#+results:
: gcc (Ubuntu/Linaro 4.6.3-1ubuntu5) 4.6.3
: Copyright (C) 2011 Free Software Foundation, Inc.
: This is free software; see the source for copying conditions.  There is NO
: warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

